"use client";

import { cn } from "@/shared/lib";

const feedBackData = [
    {
        title: 'Ангеліна (11 клас)',
        comment: [
            "Мені дуже подобається займатися з репетиторкою Софією. Заняття відбуваються дуже продуктивно, якщо мені не зрозуміла тема, або я забула її, то ми зупиняємося, щоб швиденько повторити її, або наздогнати. Я стала краще розуміти матеріал, і одну тему навіть перегнала по програмі, вивчивши з Софією раніше. З моменту як почала займатися з Софією, я відчуваю, що краще засвоюю теми у школі та більше розумію, і можу розвʼязати важчі завдання."
        ]
    },
    {
        title: 'Мама Тимофія (7 клас)',
        comment: [
            "Дуже рада, що є можливість підтягнути знання дитини онлайн. За станом здоров'я на початку навчального року син пропустив майже 2 місяці, відповідно з новими предметами (алгебра та геометрія) виникли труднощі, тому розпочали пошуки репетитора.",
            "Сину дуже подобається займатися з Дмитром, після декількох занять сказав, що ніколи не думав, що математика може бути цікавою. Мої найкращі рекомендації."
        ]
    },
    {
        title: 'Мама Ярослава (6 клас)',
        comment: [
            "Хочу виразити подяку нашому репетитору Ярославу.Він займається з моїм сином,Ярослав цікаво та доступно подає інформацію,він знайшов підхід до дитини,моїй дитині подобаються заняття,доступно,зрозуміло.Спілкування між репетитором та учнем проходять на дружньому рівні,це головне."
        ]
    },
    {
        title: 'Мама Дениса (6 клас)',
        comment: [
            "Рекомендую!!! Цікавий підхід до викладання матеріалу. Доступно, зрозуміло! Дитина з задоволенням підключається до занять!"
        ]
    }
]

export const Feedback = () => {
    return (
        <div
            className="flex flex-wrap gap-x-[3rem] gap-y-[7.5rem]"
        >
            {
                feedBackData.map((item, idx) => {
                    return (
                        <div
                            key={idx}
                            className="p-[3.5rem] w-[calc(50%-1.5rem)] rounded-[5.4rem] border-[.35rem] border-regal-blue-second"
                        >
                            <div
                                className={cn(
                                    "text-[3.3rem] pb-[3rem] text-center font-kyiv_titling"
                                )}
                            >
                                {item.title}
                            </div>
                            <div>
                                {
                                    item.comment.map((text, index) => {
                                        return (
                                            <p
                                                key={index}
                                                className="text-[2.4rem] font-sawarabi leading-[1.4721]"
                                            >
                                                {text}
                                            </p>
                                        )
                                    })
                                }
                            </div>
                        </div>
                    )
                })
            }
        </div>
    )
}