"use client";

import { Accordion, AccordionItem, AccordionTrigger, AccordionContent } from "@/shared/components";

const questions = [
    {
        question: "Як відбуваються онлайн-уроки?",
        answer: [
            "Заняття відбуваються через зручну для вас онлайн-платформу Zoom чи Google Meet, посилання надсилаємо в чат Telegram.",
            "Працюємо на онлайн-дошці, та всю інформацію з нею надсилаємо вам після заняття, тому ви точно нічого не забудете записати та в будь-який момент зможете повернутись до вже пройденого матеріалу."
        ]
    },
    {
        question: "Як оплачувати заняття?",
        answer: [
            "Ви можете оплачувати заняття кожен раз перед його початком або наперед комфортну вам кількість. Розрахунок відбувається за реквізитами ФОП."
        ]
    },
    {
        question: "Як обрати репетитора?",
        answer: [
            "Наш менеджер запропонує вам варіанти викладачів на вибір. Ви зможете переглянути розгорнуту інформацію про викладача. Також всі репетитори представлені в нашому Instagram. Якщо ви вже обрали репетиторам по анкеті в Instagram, повідомте менеджеру, що хотіли б спробувати навчатись із ним."
        ]
    },
    {
        question: "Чи є пробні уроки?",
        answer: [
            "Так, ви можете спробувати перше заняття з будь-яким викладачем абсолютно безкоштовно. Під час заняття ми перевіряємо початкові знання, визначаємо цілі та можливості у навчанні, а також опрацьовуємо завдання, з якими виникли складнощі. Після цього ми будуємо план подальшої співпраці, якщо заняття сподобалось і відбувся метч з репетитором."
        ]
    }
]

export const Questions = () => {
    return (
        <div>
            {
                questions.map((item, idx) => {
                    return (
                        <Accordion key={idx} type="single" collapsible>
                            <AccordionItem value="item-1">
                                <AccordionTrigger>{item.question}</AccordionTrigger>
                                <AccordionContent>
                                    {
                                        item.answer.map((text, index) => {
                                            return (
                                                <p
                                                    key={index}
                                                >
                                                    {text}
                                                </p>
                                            )
                                        })
                                    }
                                </AccordionContent>
                            </AccordionItem>
                        </Accordion>
                    )
                })
            }
        </div>
    )
}